ananawaretrk/Opal_Fcc_nrf52810/3rd_party/nRF5_SDK_16/examples/ble_peripheral/ble_app_uart_peripheral/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

void read_uart_until_newline_or_cr(void)
{
    
    while (true)
    {
        uint32_t err_code = app_uart_get(&byte_received);
        if (err_code == NRF_SUCCESS)
        {
            if (byte_received == '\n' || byte_received == '\r')
            {
                my_data_array[index] = '\0';  // Null-terminate the string
                index = 0;  // Reset index for next read
                break;  // Exit the loop
            }
            else if (index < UART_RX_BUF_SIZE - 1)  // -1 to leave space for null terminator
            {
                my_data_array[index++] = byte_received;
            }
            else
            {
                // Buffer overflow, you can handle it as needed
                index = 0;  // Reset index
            }
        }
    }
}

int read_uart_and_get_integer(void)
{
    uint8_t byte_received;
    static uint8_t data_array[UART_RX_BUF_SIZE];
    while (true)
    {
        uint32_t err_code = app_uart_get(&byte_received);
        if (err_code == NRF_SUCCESS)
        {
            if (byte_received == '\n' || byte_received == '\r')
            {
                data_array[index] = '\0';  // Null-terminate the string
                int received_integer = atoi((char*)data_array);  // Convert string to integer
                index = 0;  // Reset index for next read
                return received_integer;
            }
            else if (index < UART_RX_BUF_SIZE - 1)  // -1 to leave space for null terminator
            {
                data_array[index++] = byte_received;
            }
            else
            {
                // Buffer overflow, you can handle it as needed
                index = 0;  // Reset index
            }
        }
    }
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    uint32_t err_code;
    char buffer[50];
    int i=0;
    int times = 5;
    int send_frequency = 5000; // milliseconds

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.


#ifdef RECEIVER
    printf("\r\RECEIVER\r\n");
#endif // RECEIVER

    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

#ifdef SENDER
    printf("\r\nSender\r\n");
    printf("\r\nType in your payload\r\n");
    read_uart_until_newline_or_cr();
    printf("Your payload is: %s\r\n", my_data_array);

    printf("\r\n");

    printf("Type in how many time you want to send\r\n");
    times = read_uart_and_get_integer();
    printf("%d times\r\n", times);

    printf("\r\n");

    printf("How frequently you want to send? (milliseconds)\r\n");
    send_frequency = read_uart_and_get_integer();
    printf("%d milliseconds\r\n", send_frequency);

    
    for (int j = 0; j < times; j++)
    {
        snprintf(buffer, 50, "%s, %d\r\n", my_data_array, i);
        uint16_t length = (uint16_t)strlen(buffer);
        err_code = ble_nus_data_send(&m_nus, buffer, &length, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
        nrf_delay_ms(send_frequency);
        i++;
    }
#endif // SENDER

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */